In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
import math

In [21]:
df = pd.read_csv('F:/Courses/ML & DL Complete/3. Machine Learning/py-master/py-master/ML/2_linear_reg_multivariate/homeprices.csv')
df.head(5)

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [22]:
med_bedroom = math.floor(df.bedrooms.median())

In [23]:
df.bedrooms = df.bedrooms.fillna(med_bedroom)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [24]:
model= LinearRegression()
model.fit(df[['area','bedrooms','age']],df.price)
print('intercept: ',model.intercept_)
print('slope: ',model.coef_)

intercept:  221323.00186540408
slope:  [  112.06244194 23388.88007794 -3231.71790863]

In [12]:
model.predict([[1000,1,100]])

array([33602.53302218])

In [25]:
#exercise

In [30]:
dfn = pd.read_csv('F:/Courses/ML & DL Complete/3. Machine Learning/py-master/py-master/ML/2_linear_reg_multivariate/Exercise/hiring.csv')
dfn.head(5)

   experience  test_score  interview_score  salary
0         NaN         8.0                9   50000
1         NaN         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000

In [31]:
dfn.experience = dfn.experience.fillna('0')

In [32]:
med_ts=dfn.test_score.median()
dfn.test_score=dfn.test_score.fillna(med_ts)

dfn

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2          5         6.0                7   60000
3          2        10.0               10   65000
4          7         9.0                6   70000
5          3         7.0               10   62000
6         10         8.0                7   72000
7         11         7.0                8   80000

In [40]:
modeln= LinearRegression()
modeln.fit(dfn[['experience','test_score','interview_score']],dfn.salary)
print('intercept: ',modeln.intercept_)
print('slope: ',modeln.coef_)
print()
print('salry: ',modeln.predict([[2,9,6]]))

intercept:  17737.26346433771
slope:  [2812.95487627 1845.70596798 2205.24017467]

salry:  [53205.96797671]